<div class="modal is-active">
    <div class="modal-background"></div>
    <div class="modal-card agreement">
        <header class="modal-card-head is-brown-bold">
            <p class="modal-card-title">ข้อตกลงและเงื่อนไขการใช้งานเว็บไซต์ <?php echo $title;?></p>
            <button class="delete" onclick="deletePopup()"></button>
        </header>
        <section class="modal-card-body">
            ข้อที่ 1 (ข้อตกลงการใช้งาน)<br>
<br>
1. ข้อตกลงนี้กำกับดูแลการใช้งานเว็บไซต์ URL <?php echo $rootUrl;?> (เรียกรวมกันว่า "เว็บไซต์") และจัดทำขึ้นโดย ... (ต่อไปนี้เรียกว่า “บริษัท”) และเว็บไซต์นี้จัดทำขึ้นเพื่อให้บริการ <?php echo $title;?> (ต่อไปนี้เรียกว่า “ผลิตภัณฑ์และบริการ”) ซึ่งสมาชิกผู้ใช้บริการทุกคนจะต้องอยู่ภายใต้ข้อตกลงการใช้งานที่จะกล่าวต่อไป<br>
2. เมื่อผู้ใช้บริการได้ใช้บริการที่จัดขึ้น ย่อมแสดงว่าได้ยอมรับข้อตกลงและเงื่อนไขแต่ละข้อและทั้งหมดที่ระบุไว้ด้านล่าง บริษัทขอสงวนสิทธิ์โดยดุลยพินิจของเราแต่เพียงผู้เดียวในการเปลี่ยนแปลง แก้ไข เพิ่มเติม หรือลบส่วนใดๆ ของข้อกำหนดเหล่านี้เมื่อใดก็ได้โดยไม่ต้องแจ้งให้ทราบล่วงหน้า และการเปลี่ยนแปลงดังกล่าวจะมีผลทันที บริษัทไม่รับผิดชอบต่อเหตุการณ์ที่เกิดขึ้นเนื่องมาจากการเปลี่ยนแปลงข้อตกลงใดๆ การที่ผู้ใช้บริการยังคงใช้บริการหลังจากที่มีการเปลี่ยนแปลงข้อตกลงนี้ ย่อมแสดงว่าคุณยอมรับการเปลี่ยนแปลงของข้อตกลงดังกล่าว<br>
3. ข้อตกลงการใช้งานนี้อาจกำหนดข้อตกลงและเงื่อนไขอื่นๆเกี่ยวกับสมาชิกผู้ใช้บริการ ข้อกำหนดเกี่ยวกับการใช้บริการที่แสดงบนเว็บไซต์ ข้อควรระวังในการใช้งาน ข้อแนะนำการใช้งาน นโยบายในการยกเลิก และอื่นๆ (เรียกรวมกันว่า “ข้อกำหนดย่อย”) ข้อกำหนดย่อยนั้น เป็นส่วนหนึ่งของข้อตกลงหลัก แต่ในกรณีที่ข้อกำหนดย่อยมีข้อกำหนดหรือเงื่อนไขที่ขัดแย้งกันกับข้อตกลงหลัก ไม่ว่าส่วนใดส่วนหนึ่ง ให้ยึดข้อกำหนดย่อยในการดำเนินการ<br>
ข้อที่ 2 (การลงทะเบียนสมาชิก)<br>
<br>
1. การใช้บริการจะต้องอยู่ภายใต้ข้อตกลงการใช้งาน รวมถึงวิธีการและเงื่อนไขต่างๆที่บริษัทได้กำหนดไว้ และจะสามารถใช้บริการได้ก็ต่อเมื่อได้ลงทะเบียนเป็นสมาชิกผู้ใช้บริการ (ต่อไปนี้เรียกว่า ”สมาชิก”) อย่างไรก็ตามอาจมีบางกรณีที่บริษัทไม่ยอมรับการการลงทะเบียนเป็นสมาชิก<br>
2. ผู้ที่สามารถใช้บริการและลงทะเบียนเป็นสมาชิกได้นั้น จะต้องมีอายุตั้งแต่ 18 ปีบริบูรณ์ขึ้นไป<br>
3. เมื่อได้ลงทะเบียนเป็นสมาชิกผู้ใช้บริการนี้แล้ว ให้ใช้ที่อยู่อีเมลที่ลงทะเบียนไว้เป็น ID ชื่อผู้ใช้งาน และสามารถจัดการเกี่ยวกับการให้บริการและการใช้บริการได้ที่หน้าของฉัน (ต่อไปนี้เรียกว่า “หน้าของฉัน”)<br>
4. ในกรณีที่สมาชิกมีการเปลี่ยนแปลงในส่วนของ ที่อยู่ ชื่อ-นามสกุล หมายเลขโทรศัพท์ หรือข้อมูลอื่นๆที่ระบุไว้ในขั้นตอนการลงทะเบียน (ต่อไปนี้จะเรียกว่า “การลงทะเบียน”) ขอให้ปฏิบัติตามวิธีดำเนินการตามเงื่อนไขที่ทางบริษัทเรากำหนดไว้<br>
5. ในกรณีที่ทางบริษัทมีการร้องขอเอกสารยืนยันเพื่อตรวจสอบการลงทะเบียน สมาชิกจะต้องดำเนินการยื่นเอกสารภายในระยะเวลาเงื่อนไขตามที่ทางบริษัทกำหนดไว้<br>
6. ข้อมูลต่างๆที่เกี่ยวข้องกับผู้ใช้งานที่ทางบริษัทได้รับทราบตามข้อเรียกร้องการยื่นเอกสารดังที่กล่าวไว้ข้างต้น หรือหัวข้อการลงทะเบียนนั้น ทางบริษัทจะใช้ช่องทางพิเศษในการจัดการที่เรียกว่า “นโยบายความเป็นส่วนตัว” ซึ่งทางผู้ใช้จะต้องเห็นพ้องด้วย<br>
7. ในการลงทะเบียนเพื่อใช้บริการ สมาชิกแต่ละคนสามารถลงทะเบียนผู้ใช้งานได้เพียง 1 ID เท่านั้น ในกรณีที่ทางบริษัทพิจารณาแล้วว่ามีผู้ใช้งานปลอมแปลงเป็นผู้อื่นเพื่อลงทะเบียนซ้ำ หรือมีการลงทะเบียนซ้ำหลายๆครั้ง ทางเราจะขอดำเนินการตัดสิทธ์ิจากการเป็นสมาชิก รวมถึงสิทธิ์ในการซื้อคูปองเงินสดโดยที่ไม่ต้องแจ้งเหตุผลให้ทราบ<br>
8. สำหรับผู้ใช้งาน การลงทะเบียนเป็นสมาชิกนั้นมีความจำเป็นที่จะต้องใช้ข้อมูลที่ถูกต้องไม่เป็นเท็จ<br>
9. ห้ามสมาชิกทำการให้ยืม โอนสิทธ์ิความสามารถของสมาชิก หรือ ID ผู้ใช้งานแก่บุคคลที่สาม อีกทั้งการตั้ง ID ผู้ใช้บริการจะต้องไม่มีข้อความที่ทำให้บุคคลที่สามเกิดความไม่สบายใจ<br>
10. สำหรับสมาชิกที่ทางบริษัทพิจารณาในเรื่องที่เกี่ยวข้องกับการฝ่าฝืนกฎระเบียบหลัก เช่น การชำระเงินไม่ตรงตามที่กำหนด หรือไม่ยอมชำระ ซึ่งทางบริษัทถือว่าสมาชิกท่านนั้นไม่เห็นชอบด้วยบทบัญญัติที่กล่าวไว้เบื้องต้น ทางเราจึงสามารถที่จะยกเลิกการให้บริการ และรวมถึงการยกเลิกคุณสมบัติในการเป็นสมาชิกออกไปได้<br>
11. สมาชิกสามารถที่จะออกจากการเป็นสมาชิกได้ตลอดเวลาตามความประสงค์ ซึ่งในกรณีเช่นนั้นควรที่จะดำเนินการตามขั้นตอนการยกเลิกการเป็นสมาชิกที่แนะนำไว้บนเว็บไซต์<br>
ข้อที่ 3 (ผลิตภัณฑ์และบริการ)<br>
<br>
1. ผลิตภัณฑ์และบริการคือ การจัดจำหน่ายคูปองเงินสดโดยบริษัท<br>
2. สมาชิกสามารถซื้อคูปองเงินสดที่สามารถนำมาใช้ได้ที่ร้านค้าต่างๆซึ่งทางบริษัทเป็นผู้จัดเตรียมไว้ (ต่อไปนี้เรียกว่า “ร้านค้า”)<br>
3. สมาชิกที่มีความประสงค์จะซื้อคูปองเงินสด จะต้องทำการซื้อผ่านบริการนี้<br>
4. สมาชิกสามารถใช้คูปองเงินสดในการซื้อสินค้า และ/หรือ บริการของแต่ละร้านค้าได้โดยเป็นไปตามเงื่อนไขที่ร้านค้ากำหนด หากสมาชิกไม่สามารถโชว์คูปองเงินสดให้กับทางร้าน จะไม่สามารถซื้อสินค้า และ/หรือ บริการของร้านค้าตามที่ระบุในคูปองเงินสดได้<br>
5. เมื่อสมาชิกทำการซื้อคูปองเงินสดและบริษัทได้ส่งอีเมลยืนยันการขอซื้อคูปองเงินสดไปยังสมาชิกแล้ว ให้ถือว่าได้ทำสัญญาซื้อขายกันตามกฎหมาย<br>
6. บริษัทขอสงวนสิทธิ์ในการออกคูปองเงินสดให้กับสมาชิกที่ทางบริษัทได้รับการยืนยันการชำระเงินตามจำนวนที่สั่งซื้อแล้วเท่านั้น การออกคูปองเงินสดหมายถึง (i)การที่สมาชิกสามารถพิมพ์คูปองผ่านทางเวปไซต์ได้ (ii)การส่งข้อมูลที่จำเป็นในการแสดงคูปองผ่านระบบออนไลน์ หรือ (iii)การจัดส่งคูปองไปยังที่อยู่ที่สมาชิกระบุไว้ได้อย่างสมบูรณ์ หรือ (iiii)การที่สมาชิกมาชำระเงินและรับคูปองด้วยตนเองที่บริษัท อย่างใดอย่างหนึ่ง ทั้งนี้ กรณีที่สมาชิกจำเป็นต้องพิมพ์คูปองออกมานั้นสมาชิกเป็นผู้รับผิดชอบการจัดเตรียมอุปกรณ์เครื่องพิมพ์ด้วยตัวเอง กรณีที่จำเป็นต้องแสดงคูปองออนไลน์นั้นสมาชิกเป็นผู้รับผิดชอบในการจัดเตรียมอุปกรณ์สื่อสารด้วยตัวเอง<br>
7. คูปองเงินสดที่ทางบริษัทจำหน่ายคือคูปองที่ออกผ่านระบบออนไลน์ หรือการจัดพิมพ์คูปองกระดาษ และจัดส่งโดยพนักงานของทางบริษัทหรือทางไปรษณีย์ การออกคูปองผ่านระบบออนไลน์นั้น เมื่อบริษัทออกคูปองให้แก่สมาชิกแล้วถือว่ากระบวนการได้เสร็จสิ้นสมบูรณ์ กรณีการจัดส่งคูปองทางไปรษณีย์ EMS นั้น บันทึกสถานะการจัดส่งจะเป็นเอกสารรับรองการออกคูปอง วันที่ที่ไปรษณีย์ลงบันทึกการรับคูปองไว้คือวันที่ออกคูปอง กระบวนการเหล่านี้ถือว่าการออกคูปองได้เสร็จสิ้นสมบูรณ์<br>
8. สมาชิกจะต้องเป็นผู้ดูแลรับผิดชอบคูปองเงินสด แม้ว่าจะเกิดกรณีที่คูปองเงินสดสูญหาย ชำรุด เสียหาย หรือถูกบุคคลอื่นนำไปใช้จนเกิดความเสียหาย สมาชิกไม่สามารถที่จะเรียกร้องความเสียหายและค่าชดใช้จากทางร้านค้าที่เข้าร่วม หรือกับทางบริษัทได้<br>
9. คูปองเงินสดที่บริการนี้จัดพิมพ์ขึ้นมานั้นไม่ใช่เงินสด (ไม่สามารถเปลี่ยนเป็นเงินสดได้) แต่สามารถใช้เพื่อขอรับบริการของแต่ละร้านค้าที่เข้าร่วมได้<br>
10. ลูกค้าสามารถใช้คูปองเงินสดได้โดยนำคูปองเงินสดที่ทางบริษัทจัดส่งให้ไปใช้บริการกับร้านค้าที่ระบุไว้ในคูปองนั้นๆ<br>
11. ทางบริษัทไม่รับผิดชอบต่อความผิดพลาดใดๆที่อาจเกิดขึ้นของข้อมูลคูปองเงินสด สถานะการซื้อขาย ระยะเวลาการขาย ราคา หรือข้อมูลอื่นๆที่เกี่ยวข้อง<br>
12. คูปองเงินสดแต่ละใบนั้นมีระยะเวลาการใช้งานระบุไว้ ซึ่งสามารถใช้งานได้ตามระยะเวลาที่กำหนดเท่านั้น ทั้งนี้ทางบริษัทและร้านค้าไม่รับผิดชอบใดๆในการซื้อคืนคูปองเงินสดที่หมดอายุแล้ว<br>
13. สมาชิกไม่สามารถโอนสิทธิ์ที่ได้รับจากสัญญาซื้อขายระหว่างบริษัทให้กับบุคคลที่สามได้<br>
14. บริษัทไม่รับผิดชอบในการคืนคูปองเงินสดใดๆทั้งสิ้นเว้นแต่สามารถตรวจสอบได้ว่าเกิดความเสียหายระหว่างการจัดส่ง มีความบกพร่องของผลิตภัณฑ์ หรือมีการจัดส่งผลิตภัณฑ์ไม่ตรงกับการสั่งซื้อ บริษัทจะดำเนินการเปลี่ยนสินค้าใหม่ให้หรือ อาจทำการยกเลิกการซื้อขายในกรณีที่ไม่สามารถเปลี่ยนสินค้าได้ แต่ต้องขึ้นอยู่ภายใต้เงื่อนไขและภายในระยะเวลาที่ร้านค้ากำหนดเท่านั้น<br>
15. คูปองเงินสดที่ทางบริษัทจัดส่งให้แล้วนั้นไม่สามารถคืนเป็นเงินสดได้ไม่ว่าด้วยกรณีใดๆ<br>
16. บริษัทจะขอยกเลิกสัญญาการซื้อขายในกรณีที่เกิดเหตุการ์ณตามที่ระบุดังต่อไปนี้<br>
1. สมาชิกเป็นผู้ที่ยังไม่ได้บรรลุนิติภาวะที่ไม่ได้รับความเห็นชอบจากผู้แทนโดยชอบธรรม<br>
2. สมาชิกเคยทำผิดกฎระเบียบข้อบังคับ<br>
3. สมาชิกกรอกข้อมูลเท็จหรือบิดเบือนความจริงใดๆ ในขั้นตอนการสมัคร<br>
4. สมาชิกละเลยหลีกเลี่ยงการชำระเงินกับทางบริษัท<br>
5. สมาชิกได้กระทำพฤติกรรมกีดกั้นขัดขวาง รบกวนการบริหารงานของบริษัท การให้บริการของทางร้านค้า หรือการใช้งานเว็บไซต์ของสมาชิกอื่น<br>
6. สมาชิกคืนสินค้า หรือปฏิเสธการรับสินค้าโดยไม่มีสาเหตุที่สมควร<br>
7. กรณีที่บริษัทพบว่ามีความผิดพลาดในเรื่องของราคาผลิตภัณฑ์ เงื่อนไขการซื้อขายต่างๆ บนเว็บไซต์ของบริษัท<br>
8. กรณีอื่นๆที่บริษัทพิจารณาว่าไม่เหมาะสม<br>
ข้อที่ 4 (การส่งเมลแมกกาซีนและ SMS ข้อมูลข่าวสาร)<br>
<br>
บริษัทจะจัดส่งเมลแมกกาซีนและ SMS ข้อมูลข่าวสารให้แก่สมาชิก เมื่อสมาชิกได้ยินยอมรับเงื่อนไขการส่งเมลแมกกาซีนและ SMS ข้อมูลข่าวสารตามที่บริษัทกำหนดไว้<br>
ข้อที่ 5 (ทรัพย์สินทางปัญญา)<br>
<br>
1. ลิขสิทธิ์ เครื่องหมายการค้า รวมถึงทุกอย่างที่เกี่ยวข้องกับทรัพย์สินทางปัญญานั้นถือเป็นสิ่งที่อยู่ในครอบครองของบริษัท หรือผู้ที่มีสิทธิ์เท่านั้น<br>
2. สำหรับความคิดเห็นหรือข้อมูลอื่นๆที่ทางผู้ใช้งานส่งให้กับการบริการนี้ (ต่อไปนี้จะเรียกว่า “ข้อมูลที่ส่ง”) บริิษัทสามารถที่จะย้ายข้อมูล รวมถึงการลบความคิดเห็นจากทางผู้ใช้งานได้โดยชอบตามความเหมาะสม<br>
ข้อที่ 6 (ยกเลิกการเป็นสมาชิก)<br>
<br>
1. สมาชิกสามารถออกจากการเป็นสมาชิกได้โดยดำเนินการตามขั้นตอนที่ทางบริษัทกำหนดไว้<br>
2. เมื่อสมาชิกออกจากการเป็นสมาชิกแล้ว จะเสียสิทธิ์ต่างๆอันเกี่ยวเนื่องจากการเป็นสมาชิก รวมถึงข้อมูลที่ส่งมาด้วย<br>
3. ทางบริษัทจะถือว่าสมาชิกได้ออกจากการเป็นสมาชิกเมื่อสมาชิกเสียชีวิต<br>
ข้อที่ 7 (ความรับผิดชอบของผู้ใช้บริการ)<br>
<br>
1. ผู้ใช้บริการเข้าถึงและใช้บริการนี้ด้วยความเสี่ยง การตัดสินใจ และค่าใช้จ่ายของผู้ใช้บริการเอง<br>
2. ผู้ใช้บริการรับทราบและเข้าใจถึงการให้บริการเกี่ยวกับการแจ้งข้อมูลข่าวสารผ่านทางอีเมลและ SMS<br>
3. ผู้ใช้บริการเป็นผู้รับผิดชอบดูแล ID ผู้ใช้บริการ รหัสผ่านที่ใช้สำหรับลงทะเบียนสมาชิก และการดูแลหรือการเปลี่ยนรหัสผ่านอยู่เสมอเพื่อป้องกันการลักลอบใช้บริการโดยบุคคลอื่น<br>
4. บริษัทไม่รับผิดชอบต่อความเสียหายที่เกิดขึ้นอันเนื่องมาจากการลงชื่อเข้าใช้บริการด้วย ID ผู้ใช้บริการและรหัสผ่านที่ได้ลงทะเบียนโดยถูกต้องจากบุคคลอื่นที่ลักลอบใช้บริการ หรือผู้ใช้บริการอื่นที่ไม่ใช่ผู้ใช้บริการตัวจริง<br>
5. ผู้ใช้บริการยินยอมให้บริษัทดำเนินการตรวจสอบการใช้บริการเมื่อมีการใช้บริการที่ไม่ถูกต้อง<br>
6. ทางบริษัทไม่รับผิดชอบต่อปัญหาใดๆที่อาจเกิดขึ้นจากการจัดการดูแลที่ไม่รอบคอบของผู้ใช้บริการ<br>
ข้อที่ 8 (การไม่อนุมัติการใช้บริการ)<br>
<br>
ทางบริษัทขอสงวนสิทธิ์ในการพิจารณาผู้ใช้บริการโดยไม่ให้ได้รับบริการ หรือยกเลิกสมาชิก หรือยกเลิกการให้บริการส่วนใดส่วนหนึ่งหรือทั้งหมดภายใต้ดุลยพินิจของบริษัท โดยไม่ต้องคืนเงินที่ชำระค่าบริการมาแล้ว และบริษัทไม่รับผิดชอบต่อค่าเสียหายที่เกิดขึ้นแก่สมาชิกในกรณีใดๆดังต่อไปนี้<br>
1. การใช้บริการที่ขัดต่อข้อตกลงและเงื่อนไขของบริษัท หรือขัดต่อกฎหมายใดๆ<br>
2. สมาชิกนำ ID ผู้ใช้บริการและรหัสผ่าน ใช้บริการนี้ไปใช้งานหรือให้ผู้ใดนำไปใช้งานโดยไม่เหมาะสม<br>
3. ขัดขวางการบริหารจัดการเว็บไซต์<br>
4. เมื่อพบว่ามีการปลอมแปลงเนื้อหาหรือมีข้อมูลที่ไม่ครบถ้วนในการลงทะเบียน<br>
5. เมื่อไม่สามารถทำการติดต่อผู้ใช้บริการได้ทั้งทางอีเมล โทรศัพท์ หรือไม่มีการตอบรับเมื่อมีการสอบถามหรือร้องขอจากทางบริษัท<br>
6. เมื่อเกิดปัญหาในการตรวจสอบยืนยันบัตรเครดิต<br>
7. เมื่ออยู่ในกลุ่มที่ดำเนินกิจกรรมหรือมีความพยายามที่จะต่อต้านต่อสังคมหรือมีความสัมพันธ์ใกล้ชิดกับกลุ่มบุคคลดังกล่าว<br>
8. สมาชิกอยู่ในสภาพถูกยึดทรัพย์ อยู่ในระหว่างถูกจับกุมชั่วคราว อยู่ในระหว่างการลงโทษของศาล ถูกดำเนินคดี หรือเป็นบุคคลล้มละลาย<br>
9. เมื่อสมาชิกถูกตรวจสอบพบว่ามีการลงทะเบียน และมี ID ผู้ใช้บริการมากกว่าหนึ่ง<br>
10. กรณีอื่นๆ ที่ทางบริษัทพิจารณาว่าเหมาะสมที่จะไม่อนุญาตให้ใช้บริการ<br>
ข้อที่ 9 (การระงับการให้บริการ)<br>
<br>
1. ในกรณีที่เกิดเหตุการณ์ผิดพลาดทางเทคนิค เช่น การรักษาระบบ การแก้ไขความเสียหายของระบบ หรือเหตุขัดข้องสุดวิสัยจากภัยธรรมชาติ ทางบริษัทสามารถระงับการให้บริการชั่วคราวได้โดยไม่ต้องแจ้งให้สมาชิกทราบล่วงหน้า<br>
2. กรณีที่มีการระงับบริการจากเหตุการณ์ดังกล่าวข้างต้น บริษัทจะดำเนินการอย่างใดอย่างหนึ่ง เช่น ชดเชยเวลา หรือขยายเวลาออกไปชั่วระยะหนึ่งตามความเหมาะสม<br>
3. บริษัทไม่รับผิดชอบต่อความเสียหายใดๆที่เกิดจากเหตุการณ์ดังกล่าวข้างต้น<br>
4. บริษัทจะไม่ชดใช้ค่าเสียหายใดๆ หากมีไวรัสคอมพิวเตอร์ที่ติดไปกับข้อความ SMS ซึ่งถูกส่งมาจากเว็บไซต์ เซิร์ฟเวอร์ หรือโดเมนต่างๆ จากการให้บริการของบริษัทเราจนก่อให้เกิดความเสียหายใดๆแก่สมาชิก<br>
5. บริษัทไม่ชดใช้ค่าเสียหายใดๆ ที่ก่อให้เกิดความเสียหายแก่ผู้ใช้บริการ เนื่องมาจากข้อมูลของระบบการสื่อสารหรือคอมพิวเตอร์เสียหาย ระบบหยุดชะงักล่าช้า ข้อมูลสูญหาย หรือเกิดความผิดพลาดต่างๆ จากการใช้งานที่ไม่ถูกต้อง<br>
ข้อที่ 10 (การเปลี่ยนแปลง หรือยกเลิกการให้บริการ)<br>
<br>
1. ทางบริษัทสามารถถ่ายโอน เปลี่ยนแปลงเนื้อหาการให้บริการได้โดยที่ไม่ต้องแจ้งให้ผู้ใช้งานทราบล่วงหน้า แม้ว่าอาจจะส่งผลเสียแก่ผู้ใช้บริการโดยไม่ต้องรับผิดชอบใดๆทั้งสิ้น<br>
2. ทางบริษัทสามารถที่จะระงับหรือยกเลิกการให้บริการได้โดยที่ไม่ได้แจ้งให้ทางผู้ใช้งานทราบล่วงหน้า แม้ว่าอาจจะส่งผลเสียแก่ผู้ใช้บริการโดยไม่ต้องรับผิดชอบใดๆทั้งสิ้น<br>
ข้อที่ 11 (เวลามาตรฐาน)<br>
<br>
บริษัทจะยึดถือเวลามาตรฐานตามที่เซิร์ฟเวอร์จัดการควบคุมแสดง ตั้งแต่เวลาสั่งซื้อจนเสร็จสิ้นขั้นตอน ระยะเวลาที่รับข้อมูลการสั่งซื้อ การจัดพิมพ์คูปองเงินสด ซึ่งทางบริษัทไม่อาจรับประกันข้อมูลเวลาที่แสดงบนการให้บริการได้<br>
ข้อที่ 12 (การกระทำต้องห้าม)<br>
<br>
ห้ามผู้ใช้บริการกระทำเรื่องที่ระบุไว้ตามข้อความที่ระบุดังต่อไปนี้<br>
1. การกระทำที่เป็นการขัดต่อข้อกำหนดและเงื่อนไขการใช้บริการ<br>
2. การกระทำที่ขัดต่อกฎหมาย<br>
3. การกระทำที่ในเชิงอาชญากรรม หรือในเชิงที่สื่อถึงอาชญากรรม<br>
4. การกระทำที่ส่งเสริมหรือสนับสนุนในเชิงอาชญากรรม<br>
5. การกระทำที่เป็นการเปิดเผยข้อมูลส่วนตัวของผู้ใช้บริการอื่น หรือบุคคลที่สาม<br>
6. การกระทำที่ทำให้ผู้ใช้บริการอื่น หรือบุคคลที่สามสูญเสียผลประโยชน์<br>
7. การกระทำที่บริษัทมองว่าสื่อไปทางลามกอนาจาร สื่อสิ่งพิมพ์ลามก หรือการทารุณกรรมต่อเด็กและเยาวชน<br>
8. การกระทำปลอมแปลงเป็นบุคคลอื่นเพื่อใช้บริการ<br>
9. การกระทำทุจริตที่เป็นการโจมตีโครงสร้างของบริการ<br>
10. การกระทำที่เจตนาทำให้เกิดปัญหาต่อระบบของบริการ<br>
11. การกระทำที่เป็นการปลอมแปลงข้อมูลการใช้งานที่เกี่ยวข้องกับบริการ<br>
12. การส่งไวรัสคอมพิวเตอร์หรือโปรแกรมอันตรายต่างๆ รวมถึงการกระทำที่เป็นการสนับสนุน หรือให้การส่งเสริมการกระทำนั้นๆ<br>
13. การกระทำที่ก่อให้เกิดผลประโยชน์ทางการเงินที่อยู่นอกเหนือจากที่บริษัทอนุญาต<br>
14. การกระทำที่เชื่อมโยงถึงองค์กรหรือบริการอื่นที่ไม่ได้มีส่วนเกี่ยวข้องกับการให้บริการของทางบริษัท<br>
15. การกระทำที่เป็นการละเมิดทรัพย์สินทางปัญญา<br>
16. การกระทำที่เป็นการใส่ร้าย นินทาว่าร้าย หมิ่นประมาทผู้ใช้บริการรายอื่นหรือร้านค้าที่ให้บริการ<br>
17. การกระทำที่ผู้ใช้งาน 1 คนมีบัญชีสมาชิกหลายบัญชีเพื่อจุดประสงค์ในทางที่ไม่เหมาะสม<br>
18. การกระทำที่เป็นการโฆษณา หรือเชิญชวนเกินความเป็นจริงแก่บุคคลที่สาม<br>
19. การกระทำที่เป็นการก่อกวน หรือขัดขวางการดูแลจัดการเว็บไซต์และบริการ<br>
20. การกระทำที่เป็นการล่วงละเมิดหรือก่อให้เกิดการล่วงละเมิดทรัพย์สินทางปัญญาของบริษัท ผู้ใช้บริการอื่น หรือบุคคลที่สาม<br>
21. การกระทำที่นอกเหนือจากวิธีการใช้ที่เหมาะสมซึ่งบริษัทกำหนดไว้ เช่น การนำคูปองมาขายต่อ ให้เช่า หรือจำนำ เป็นต้น<br>
22. การขายคูปองเงินสดต่อ หรือให้เช่าแก่บุคคลที่สาม<br>
23. การกระทำที่ก่อให้เกิดผลกำไรจากการใช้บริการ<br>
24. การกระทำอื่นๆที่ทางบริษัทพิจารณาว่าไม่เหมาะสม<br>
ข้อที่ 13 (การตรวจสอบ สภาวะการใช้งาน)<br>
<br>
บริการและส่วนควบคุมเนื้อหาของบริการแสดงผลด้วย “Cookies” และ JavaScript จึงอาจทำให้เกิดการหยุดทำงานอันเนื่องมาจากการตั้งค่าการใช้งานของผู้ใช้บริการ บริษัทจะไม่รับผิดชอบในความไม่สะดวกใดๆ<br>
ข้อที่ 14 (การป้องกัน)<br>
<br>
1. ทางบริษัทจะไม่มีส่วนในการแก้ไขเปลี่ยนแปลงในกรณีที่ผู้ใช้งานใช้อุปกรณ์ เครื่องมือ หรือซอฟต์แวร์ที่ไม่เหมาะสมกับการใช้งาน<br>
2. ทางบริษัทจะไม่มีการชดใช้ค่าเสียหายใดๆ ในกรณีที่เกิดความเสียหายใดๆของผู้ใช้บริการอันเกิดมาจากการที่ข้อมูลของระบบการสื่อสารหรือคอมพิวเตอร์เสียหาย ระบบหยุดชะงักล่าช้า ข้อมูลสูญหาย หรือเกิดความผิดพลาดต่างๆจากการใช้งานที่ไม่ถูกต้อง<br>
3. บริการนี้ไม่มีส่วนรับผิดชอบหรือรับประกันใดๆที่เกี่ยวข้องกับการซื้อขายคูปองเงินสด ทั้งเรื่องของราคา เงื่อนไขส่วนลด ข้อมูลสินค้า อีกทั้งทางบริษัทยังไม่มีส่วนรับผิดชอบต่อความล่าช้า หรือผลกระทบต่างๆที่เกิดขึ้นจากความล่าช้าในการได้รับคูปองเงินสด ( รวมถึงความผิดพลาดของข้อมูลเวลาทำการซื้อขาย)<br>
4. ทางบริษัทไม่มีส่วนรับผิดชอบในความเสียหายที่เกิดขึ้นจากเงื่อนไขต่างๆ ของคูปองเงินสดที่แต่ละร้านค้าได้กำหนด<br>
5. ผู้ใช้งานที่ถูกยกเลิกบริการต่างๆ ตามที่กล่าวไว้ข้างต้น จะไม่สามารถเรียกร้องใดๆ และบริษัทเราจะไม่มีส่วนเกี่ยวข้องใดๆในการรับผิดชอบความเสียหายที่เกิดขึ้น<br>
6. บริษัทจะไม่ชดใช้ค่าเสียหายใดๆ หากมีไวรัสคอมพิวเตอร์ที่ติดไปกับข้อความ SMS ซึ่งถูกส่งมาจากเว็บไซต์ เซิร์ฟเวอร์ หรือโดเมนต่างๆ จากการให้บริการของบริษัทเราจนก่อให้เกิดความเสียหายใดๆแก่สมาชิก<br>
7. ทางบริษัทไม่มีส่วนรับผิดชอบเกี่ยวกับความเสียหายที่เกิดขึ้นจากการไม่สามารถใช้บริการของทางบริษัทได้<br>
8. ผู้ใช้บริการต้องเป็นผู้รับความเสี่ยงต่างๆทั้งไวรัสคอมพิวเตอร์ หรือโปรแกรมใดๆที่อาจสร้างความเสียหายในขณะที่ผู้ใช้งานใช้บริการเว็บไซต์<br>
9. ทางบริษัทไม่รับผิดชอบใดๆในการทำงานของอุปกรณ์ หรือซอฟต์แวร์ต่างๆ ที่ผู้ใช้งานใช้บริการเว็บไซต์<br>
10. ทางบริษัทไม่รับผิดชอบค่าใช้จ่ายใดๆ ในการสื่อสาร หรือค่าใช้จ่ายอุปกรณ์ขณะที่ผู้ใช้งานใช้บริการเว็บไซต์<br>
11. สินค้าจากแต่ละร้านค้าไม่ได้มีส่วนเกี่ยวข้องใดๆ กับทางบริษัท ผู้ใช้งานต้องเป็นผู้รับผิดชอบทั้งหมด<br>
12. ทางบริษัทจะไม่รับผิดชอบคุณภาพของสินค้า คุณภาพวัตถุดิบ ประสิทธิภาพ ประสิทธิผลหรืออื่นๆ ซึ่งเป็นต้นเหตุให้เกิดความเสียหายของการให้บริการในแต่ละร้านค้า โดยยกเว้นจากข้อที่ 3 ลำดับที่ 14 ผู้ใช้งานจะต้องเป็นผู้ติดต่อสอบถามกับร้านค้าโดยตรง<br>
13. บริษัทจะรับผิดชอบในการจัดส่งสินค้าตามที่ทางสมาชิกได้ระบุปลายทางจัดส่งตามที่กำหนดไว้เท่านั้น โดยทางบริษัทและร้านค้าจะไม่มีส่วนรับผิดชอบหากเกิดปัญหาการระบุปลายทางในการจัดส่งไม่ชัดเจน<br>
14. บริษัทจะไม่รับผิดชอบใดๆ หากเกิดความเสียหายหรือค่าใช้จ่ายใดๆ ทั้งทางตรงและทางอ้อมแก่ผู้ใช้งาน ผู้ใช้บริการจะต้องเป็นผู้รับผิดชอบค่าใช้จ่ายใดๆ ที่อาจเกิดขึ้นเองทั้งหมด<br>
15.ท่านสามารถซื้อคูปองได้ไม่เกินจำนวนสูงสุดที่กำหนด เนื่องจากทุกๆ บริการจะมีการจำกัดจำนวนการซื้อสูงสุดเอาไว้<br>
ข้อที่ 15 (ผลบังคับใช้กฏระเบียบ)<br>
<br>
1. หากส่วนหนึ่งของข้อกำหนดและเงื่อนไขใดๆ ถูกพิจารณาว่าเป็นโมฆะตามกฎหมาย แต่ข้อบังคับส่วนอื่นๆ จะยังคงมีผลบังคับใช้ต่อไป<br>
2. ในกรณีที่ผู้ใช้งานบางท่านถูกพิจารณาเป็นโมฆะหรือถูกยกเลิก เกี่ยวกับส่วนหนึ่งส่วนใดในข้อกำหนดและเงื่อนไข แต่ข้อกำหนดและเงื่อนไขนั้นยังคงมีผลกับผู้ใช้งานอื่นอยู่<br>
ข้อที่ 16 (การชำระค่าเสียหาย)<br>
<br>
ในกรณีที่ผู้ใช้งานละเมิดข้อกำหนดและเงื่อนไขในการใช้งานจนส่งผลให้เกิดความเสียหายกับบริษัทหรือบุคคลที่สาม ผู้ที่ละเมิดจะต้องเป็นผู้รับผิดชอบค่าเสียหายทั้งหมดที่เกิดขึ้น<br>
ข้อที่ 17 (กฏหมายบังคับใช้ , ขอบเขตอำนาจศาล)<br>
<br>
การจัดการควบคุมการใช้งานบริการของทางบริษัทเราได้ปรับใช้ตามกฎหมายที่บังคับใช้ในราชอาณาจักรไทย ทั้งนี้การพิพาทที่เกี่ยวข้องกับการบริหารจัดการเว็บไซต์ของบริษัททั้งหมดนั้น จะดำเนินการตามอำนาจของศาลทางกฎหมายในราชอาณาจักรไทย<br>
        </section>
        <footer class="modal-card-foot">
                    <div id="data"></div>
            <a id="accept" class="button is-brown-bold">ยอมรับข้อตกลงและเงื่อนไขการใช้งาน</a>
        </footer>
    </div>
</div>
<script>
    $('.agreement .modal-card-body').scroll(function(event) {
        if($(this).scrollTop() >= $(this).get(0).scrollTopMax) {
            $("#accept").removeClass('is-disabled');
        }
        else {
            $("#accept").addClass('is-disabled');
        }
    });
    $("#accept").click(function(){
        $.get(url+'?layout=register&actype='+user.actype, function(data){
            $('.popup').html(data);
        });
    });
</script>